nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxn236/driver_examples/tdet/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made
 *to this file will be overwritten if the respective MCUXpresso Config Tools is
 *used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MCXN236
package_id: MCXN236VDF
mcu_data: ksdk2_0
processor_version: 16.3.0
board: FRDM-MCXN236
pin_labels:
- {pin_num: M10, pin_signal: PIO5_2/VBAT_WAKEUP_b/SPC_LPREQ/TAMPER0/ADC1_B10, label: 'P5_2/J6[2]', identifier: TAMPER_0}
- {pin_num: N11, pin_signal: PIO5_3/TRIG_IN11/RTC_CLKOUT/TAMPER1/ADC1_B11, label: 'P5_3/J6[1]', identifier: TAMPER_1}
- {pin_num: M12, pin_signal: PIO5_4/TRIG_OUT7/SPC_LPREQ/TAMPER2/ADC1_B12, label: 'P5_4/J7[4]', identifier: TAMPER_2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "pin_mux.h"
#include "fsl_common.h"
#include "fsl_port.h"

/* FUNCTION
 * ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END
 * ****************************************************************************************************************/
void BOARD_InitBootPins(void) { BOARD_InitPins(); }

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P0, pin_signal: PIO1_8/WUU0_IN10/LPTMR1_ALT3/TRACE_DATA0/FC4_P0/FC5_P4/CT_INP8/FLEXIO0_D16/EZH_PIO4/I3C1_SDA/ADC1_A8,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable,
    invert_input: normal}
  - {pin_num: B1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P1, pin_signal: PIO1_9/TRACE_DATA1/FC4_P1/FC5_P5/CT_INP9/FLEXIO0_D17/EZH_PIO5/I3C1_SCL/ADC1_A9, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: M10, peripheral: TDET0, signal: 'TAMPER, 0', pin_signal: PIO5_2/VBAT_WAKEUP_b/SPC_LPREQ/TAMPER0/ADC1_B10}
  - {pin_num: N11, peripheral: TDET0, signal: 'TAMPER, 1', pin_signal: PIO5_3/TRIG_IN11/RTC_CLKOUT/TAMPER1/ADC1_B11}
  - {pin_num: K13, peripheral: TDET0, signal: 'TAMPER, 4', pin_signal: PIO5_6/TRIG_OUT6/LPTMR1_ALT2/TAMPER4/ADC1_B14}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION
 * ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical
 * features.
 *
 * END
 * ****************************************************************************************************************/
void BOARD_InitPins(void) {
  /* Enables the clock for PORT1: Enables clock */
  CLOCK_EnableClock(kCLOCK_Port1);

  const port_pin_config_t DEBUG_UART_RX = {
      /* Internal pull-up/down resistor is disabled */
      .pullSelect = kPORT_PullDisable,
      /* Low internal pull resistor value is selected. */
      .pullValueSelect = kPORT_LowPullResistor,
      /* Fast slew rate is configured */
      .slewRate = kPORT_FastSlewRate,
      /* Passive input filter is disabled */
      .passiveFilterEnable = kPORT_PassiveFilterDisable,
      /* Open drain output is disabled */
      .openDrainEnable = kPORT_OpenDrainDisable,
      /* Low drive strength is configured */
      .driveStrength = kPORT_LowDriveStrength,
      /* Pin is configured as FC4_P0 */
      .mux = kPORT_MuxAlt2,
      /* Digital input enabled */
      .inputBuffer = kPORT_InputBufferEnable,
      /* Digital input is not inverted */
      .invertInput = kPORT_InputNormal,
      /* Pin Control Register fields [15:0] are not locked */
      .lockRegister = kPORT_UnlockRegister};
  /* PORT1_8 (pin A1) is configured as FC4_P0 */
  PORT_SetPinConfig(BOARD_INITPINS_DEBUG_UART_RX_PORT,
                    BOARD_INITPINS_DEBUG_UART_RX_PIN, &DEBUG_UART_RX);

  const port_pin_config_t DEBUG_UART_TX = {
      /* Internal pull-up/down resistor is disabled */
      .pullSelect = kPORT_PullDisable,
      /* Low internal pull resistor value is selected. */
      .pullValueSelect = kPORT_LowPullResistor,
      /* Fast slew rate is configured */
      .slewRate = kPORT_FastSlewRate,
      /* Passive input filter is disabled */
      .passiveFilterEnable = kPORT_PassiveFilterDisable,
      /* Open drain output is disabled */
      .openDrainEnable = kPORT_OpenDrainDisable,
      /* Low drive strength is configured */
      .driveStrength = kPORT_LowDriveStrength,
      /* Pin is configured as FC4_P1 */
      .mux = kPORT_MuxAlt2,
      /* Digital input enabled */
      .inputBuffer = kPORT_InputBufferEnable,
      /* Digital input is not inverted */
      .invertInput = kPORT_InputNormal,
      /* Pin Control Register fields [15:0] are not locked */
      .lockRegister = kPORT_UnlockRegister};
  /* PORT1_9 (pin B1) is configured as FC4_P1 */
  PORT_SetPinConfig(BOARD_INITPINS_DEBUG_UART_TX_PORT,
                    BOARD_INITPINS_DEBUG_UART_TX_PIN, &DEBUG_UART_TX);

  PORT5->PCR[2] =
      ((PORT5->PCR[2] &
        /* Mask bits to zero which are setting */
        (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

       /* Pin Multiplex Control: PORT5_2 (pin M10) is configured as TAMPER0. */
       | PORT_PCR_MUX(PORT5_PCR_MUX_mux11)

       /* Input Buffer Enable: Enables. */
       | PORT_PCR_IBE(PCR_IBE_ibe1));

  PORT5->PCR[3] =
      ((PORT5->PCR[3] &
        /* Mask bits to zero which are setting */
        (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

       /* Pin Multiplex Control: PORT5_3 (pin N11) is configured as TAMPER1. */
       | PORT_PCR_MUX(PORT5_PCR_MUX_mux11)

       /* Input Buffer Enable: Enables. */
       | PORT_PCR_IBE(PCR_IBE_ibe1));

  PORT5->PCR[6] =
      ((PORT5->PCR[6] &
        /* Mask bits to zero which are setting */
        (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

       /* Pin Multiplex Control: PORT5_6 (pin K13) is configured as TAMPER4. */
       | PORT_PCR_MUX(PORT5_PCR_MUX_mux11)

       /* Input Buffer Enable: Enables. */
       | PORT_PCR_IBE(PCR_IBE_ibe1));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
